{
  "_name_or_path": "roberta-large",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "accept_reservations",
    "1": "account_blocked",
    "2": "alarm",
    "3": "application_status",
    "4": "apr",
    "5": "are_you_a_bot",
    "6": "balance",
    "7": "bill_balance",
    "8": "bill_due",
    "9": "book_flight",
    "10": "book_hotel",
    "11": "calculator",
    "12": "calendar",
    "13": "calendar_update",
    "14": "calories",
    "15": "cancel",
    "16": "cancel_reservation",
    "17": "car_rental",
    "18": "card_declined",
    "19": "carry_on",
    "20": "change_accent",
    "21": "change_ai_name",
    "22": "change_language",
    "23": "change_speed",
    "24": "change_user_name",
    "25": "change_volume",
    "26": "confirm_reservation",
    "27": "cook_time",
    "28": "credit_limit",
    "29": "credit_limit_change",
    "30": "credit_score",
    "31": "current_location",
    "32": "damaged_card",
    "33": "date",
    "34": "definition",
    "35": "direct_deposit",
    "36": "directions",
    "37": "distance",
    "38": "do_you_have_pets",
    "39": "exchange_rate",
    "40": "expiration_date",
    "41": "find_phone",
    "42": "flight_status",
    "43": "flip_coin",
    "44": "food_last",
    "45": "freeze_account",
    "46": "fun_fact",
    "47": "gas",
    "48": "gas_type",
    "49": "goodbye",
    "50": "greeting",
    "51": "how_busy",
    "52": "how_old_are_you",
    "53": "improve_credit_score",
    "54": "income",
    "55": "ingredient_substitution",
    "56": "ingredients_list",
    "57": "insurance",
    "58": "insurance_change",
    "59": "interest_rate",
    "60": "international_fees",
    "61": "international_visa",
    "62": "jump_start",
    "63": "last_maintenance",
    "64": "lost_luggage",
    "65": "make_call",
    "66": "maybe",
    "67": "meal_suggestion",
    "68": "meaning_of_life",
    "69": "measurement_conversion",
    "70": "meeting_schedule",
    "71": "min_payment",
    "72": "mpg",
    "73": "new_card",
    "74": "next_holiday",
    "75": "next_song",
    "76": "no",
    "77": "nutrition_info",
    "78": "oil_change_how",
    "79": "oil_change_when",
    "80": "oos",
    "81": "order",
    "82": "order_checks",
    "83": "order_status",
    "84": "pay_bill",
    "85": "payday",
    "86": "pin_change",
    "87": "play_music",
    "88": "plug_type",
    "89": "pto_balance",
    "90": "pto_request",
    "91": "pto_request_status",
    "92": "pto_used",
    "93": "recipe",
    "94": "redeem_rewards",
    "95": "reminder",
    "96": "reminder_update",
    "97": "repeat",
    "98": "replacement_card_duration",
    "99": "report_fraud",
    "100": "report_lost_card",
    "101": "reset_settings",
    "102": "restaurant_reservation",
    "103": "restaurant_reviews",
    "104": "restaurant_suggestion",
    "105": "rewards_balance",
    "106": "roll_dice",
    "107": "rollover_401k",
    "108": "routing",
    "109": "schedule_maintenance",
    "110": "schedule_meeting",
    "111": "share_location",
    "112": "shopping_list",
    "113": "shopping_list_update",
    "114": "smart_home",
    "115": "spelling",
    "116": "spending_history",
    "117": "sync_device",
    "118": "taxes",
    "119": "tell_joke",
    "120": "text",
    "121": "thank_you",
    "122": "time",
    "123": "timer",
    "124": "timezone",
    "125": "tire_change",
    "126": "tire_pressure",
    "127": "todo_list",
    "128": "todo_list_update",
    "129": "traffic",
    "130": "transactions",
    "131": "transfer",
    "132": "translate",
    "133": "travel_alert",
    "134": "travel_notification",
    "135": "travel_suggestion",
    "136": "uber",
    "137": "update_playlist",
    "138": "user_name",
    "139": "vaccines",
    "140": "w2",
    "141": "weather",
    "142": "what_are_your_hobbies",
    "143": "what_can_i_ask_you",
    "144": "what_is_your_name",
    "145": "what_song",
    "146": "where_are_you_from",
    "147": "whisper_mode",
    "148": "who_do_you_work_for",
    "149": "who_made_you",
    "150": "yes"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "accept_reservations": 0,
    "account_blocked": 1,
    "alarm": 2,
    "application_status": 3,
    "apr": 4,
    "are_you_a_bot": 5,
    "balance": 6,
    "bill_balance": 7,
    "bill_due": 8,
    "book_flight": 9,
    "book_hotel": 10,
    "calculator": 11,
    "calendar": 12,
    "calendar_update": 13,
    "calories": 14,
    "cancel": 15,
    "cancel_reservation": 16,
    "car_rental": 17,
    "card_declined": 18,
    "carry_on": 19,
    "change_accent": 20,
    "change_ai_name": 21,
    "change_language": 22,
    "change_speed": 23,
    "change_user_name": 24,
    "change_volume": 25,
    "confirm_reservation": 26,
    "cook_time": 27,
    "credit_limit": 28,
    "credit_limit_change": 29,
    "credit_score": 30,
    "current_location": 31,
    "damaged_card": 32,
    "date": 33,
    "definition": 34,
    "direct_deposit": 35,
    "directions": 36,
    "distance": 37,
    "do_you_have_pets": 38,
    "exchange_rate": 39,
    "expiration_date": 40,
    "find_phone": 41,
    "flight_status": 42,
    "flip_coin": 43,
    "food_last": 44,
    "freeze_account": 45,
    "fun_fact": 46,
    "gas": 47,
    "gas_type": 48,
    "goodbye": 49,
    "greeting": 50,
    "how_busy": 51,
    "how_old_are_you": 52,
    "improve_credit_score": 53,
    "income": 54,
    "ingredient_substitution": 55,
    "ingredients_list": 56,
    "insurance": 57,
    "insurance_change": 58,
    "interest_rate": 59,
    "international_fees": 60,
    "international_visa": 61,
    "jump_start": 62,
    "last_maintenance": 63,
    "lost_luggage": 64,
    "make_call": 65,
    "maybe": 66,
    "meal_suggestion": 67,
    "meaning_of_life": 68,
    "measurement_conversion": 69,
    "meeting_schedule": 70,
    "min_payment": 71,
    "mpg": 72,
    "new_card": 73,
    "next_holiday": 74,
    "next_song": 75,
    "no": 76,
    "nutrition_info": 77,
    "oil_change_how": 78,
    "oil_change_when": 79,
    "oos": 80,
    "order": 81,
    "order_checks": 82,
    "order_status": 83,
    "pay_bill": 84,
    "payday": 85,
    "pin_change": 86,
    "play_music": 87,
    "plug_type": 88,
    "pto_balance": 89,
    "pto_request": 90,
    "pto_request_status": 91,
    "pto_used": 92,
    "recipe": 93,
    "redeem_rewards": 94,
    "reminder": 95,
    "reminder_update": 96,
    "repeat": 97,
    "replacement_card_duration": 98,
    "report_fraud": 99,
    "report_lost_card": 100,
    "reset_settings": 101,
    "restaurant_reservation": 102,
    "restaurant_reviews": 103,
    "restaurant_suggestion": 104,
    "rewards_balance": 105,
    "roll_dice": 106,
    "rollover_401k": 107,
    "routing": 108,
    "schedule_maintenance": 109,
    "schedule_meeting": 110,
    "share_location": 111,
    "shopping_list": 112,
    "shopping_list_update": 113,
    "smart_home": 114,
    "spelling": 115,
    "spending_history": 116,
    "sync_device": 117,
    "taxes": 118,
    "tell_joke": 119,
    "text": 120,
    "thank_you": 121,
    "time": 122,
    "timer": 123,
    "timezone": 124,
    "tire_change": 125,
    "tire_pressure": 126,
    "todo_list": 127,
    "todo_list_update": 128,
    "traffic": 129,
    "transactions": 130,
    "transfer": 131,
    "translate": 132,
    "travel_alert": 133,
    "travel_notification": 134,
    "travel_suggestion": 135,
    "uber": 136,
    "update_playlist": 137,
    "user_name": 138,
    "vaccines": 139,
    "w2": 140,
    "weather": 141,
    "what_are_your_hobbies": 142,
    "what_can_i_ask_you": 143,
    "what_is_your_name": 144,
    "what_song": 145,
    "where_are_you_from": 146,
    "whisper_mode": 147,
    "who_do_you_work_for": 148,
    "who_made_you": 149,
    "yes": 150
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
